Documents/ВозвратИзРегистра2ЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ВозвратИзРегистра2ЕГАИС</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратИзРегистра2ЕГАИС/Ext/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура КочетовОбработкаЗаполненияПосле(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		ЭтотОбъект.УстановитьНовыйНомер();
		Дата=ТекущаяДата();
		ЭтотОбъект.ДокументОснование=ДанныеЗаполнения.ссылка;
		СтатусОбработки=Перечисления.СтатусыОбработкиВозвратаИзРегистра2ЕГАИС.Черновик;
		Для каждого стр из ДанныеЗаполнения.Товары Цикл
			Если стр.номенклатура.АлкогольнаяПродукция=Истина Тогда
				стрЕГ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(стрЕГ,стр);
				стрЕГ.АлкогольнаяПродукция=стрЕГ.Справка2.АлкогольнаяПродукция;
			КонецЕсли;
		КонеццИКЛА;	
	КонецЕсли;
	
КонецПроцедуры
